pdshelley/HALGEN/atdf/ATmegaS128.atdf
    <module caption="JTAG Interface" name="JTAG">
      <register-group caption="JTAG Interface" name="JTAG">
        <register caption="On-Chip Debug Related Register in I/O Memory" name="OCDR" offset="0x42" size="1" ocd-rw="">
          <bitfield caption="On-Chip Debug Register Bits" mask="0xFF" name="OCDR"/>
        </register>
        <register caption="MCU Control And Status Register" name="MCUCSR" offset="0x54" size="1">
          <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
          <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
        </register>
      </register-group>
    </module>
    <module caption="Other Registers" name="MISC">
      <register-group caption="Other Registers" name="MISC">
        <register caption="Special Function IO Register" name="SFIOR" offset="0x40" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x08" name="ACME"/>
          <bitfield caption="Pull Up Disable" mask="0x04" name="PUD"/>
          <bitfield caption="Prescaler Reset Timer/Counter0" mask="0x02" name="PSR0"/>
          <bitfield caption="Prescaler Reset Timer/Counter3, Timer/Counter2, and Timer/Counter1" mask="0x01" name="PSR321"/>
        </register>
      </register-group>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="External Interrupt Control Register A" name="EICRA" offset="0x6A" size="1">
          <bitfield caption="External Interrupt Sense Control Bit" mask="0xC0" name="ISC3" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x30" name="ISC2" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x0C" name="ISC1" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL"/>
        </register>
        <register caption="External Interrupt Control Register B" name="EICRB" offset="0x5A" size="1">
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0xC0" name="ISC7" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x30" name="ISC6" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x0C" name="ISC5" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x03" name="ISC4" values="INTERRUPT_SENSE_CONTROL"/>
        </register>
        <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x59" size="1">
          <bitfield caption="External Interrupt Request 7 Enable" mask="0xFF" name="INT"/>
        </register>
        <register caption="External Interrupt Flag Register" name="EIFR" offset="0x58" size="1" ocd-rw="R">
          <bitfield caption="External Interrupt Flags" mask="0xFF" name="INTF"/>
        </register>
      </register-group>
      <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
        <value caption="Low Level of INTX" name="LOW_LEVEL_OF_INTX" value="0x00"/>
        <value caption="Any Logical Change of INTX" name="ANY_LOGICAL_CHANGE_OF_INTX" value="0x01"/>
        <value caption="Falling Edge of INTX" name="FALLING_EDGE_OF_INTX" value="0x02"/>
        <value caption="Rising Edge of INTX" name="RISING_EDGE_OF_INTX" value="0x03"/>
      </value-group>
    </module>
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Read/Write Access  Bytes" name="EEAR" offset="0x3E" size="2" mask="0x0FFF"/>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x3D" size="1" mask="0xFF"/>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3C" size="1">
          <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMWE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEWE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTA">
        <register caption="Port A Data Register" name="PORTA" offset="0x3B" size="1" mask="0xFF"/>
        <register caption="Port A Data Direction Register" name="DDRA" offset="0x3A" size="1" mask="0xFF"/>
        <register caption="Port A Input Pins" name="PINA" offset="0x39" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port B Data Register" name="PORTB" offset="0x38" size="1" mask="0xFF"/>
        <register caption="Port B Data Direction Register" name="DDRB" offset="0x37" size="1" mask="0xFF"/>
        <register caption="Port B Input Pins" name="PINB" offset="0x36" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTC">
        <register caption="Port C Data Register" name="PORTC" offset="0x35" size="1" mask="0xFF"/>
        <register caption="Port C Data Direction Register" name="DDRC" offset="0x34" size="1" mask="0xFF"/>
        <register caption="Port C Input Pins" name="PINC" offset="0x33" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTD">
        <register caption="Port D Data Register" name="PORTD" offset="0x32" size="1" mask="0xFF"/>
        <register caption="Port D Data Direction Register" name="DDRD" offset="0x31" size="1" mask="0xFF"/>
        <register caption="Port D Input Pins" name="PIND" offset="0x30" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTE">
        <register caption="Data Register, Port E" name="PORTE" offset="0x23" size="1" mask="0xFF"/>
        <register caption="Data Direction Register, Port E" name="DDRE" offset="0x22" size="1" mask="0xFF"/>
        <register caption="Input Pins, Port E" name="PINE" offset="0x21" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
