pdshelley/HALGEN/atdf/ATmegaS128.atdf
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control Register" name="WDTCR" offset="0x41" size="1">
          <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
          <bitfield caption="Watch Dog Timer Prescaler bits" mask="0x07" name="WDP" values="WDOG_TIMER_PRESCALE_3BITS"/>
        </register>
      </register-group>
      <value-group name="WDOG_TIMER_PRESCALE_3BITS">
        <value caption="Oscillator Cycles 16K" name="OSCILLATOR_CYCLES_16K" value="0x00"/>
        <value caption="Oscillator Cycles 32K" name="OSCILLATOR_CYCLES_32K" value="0x01"/>
        <value caption="Oscillator Cycles 64K" name="OSCILLATOR_CYCLES_64K" value="0x02"/>
        <value caption="Oscillator Cycles 128K" name="OSCILLATOR_CYCLES_128K" value="0x03"/>
        <value caption="Oscillator Cycles 256K" name="OSCILLATOR_CYCLES_256K" value="0x04"/>
        <value caption="Oscillator Cycles 512K" name="OSCILLATOR_CYCLES_512K" value="0x05"/>
        <value caption="Oscillator Cycles 1024K" name="OSCILLATOR_CYCLES_1024K" value="0x06"/>
        <value caption="Oscillator Cycles 2048K" name="OSCILLATOR_CYCLES_2048K" value="0x07"/>
      </value-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x27" size="1">
          <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF2"/>
          <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x1F" name="MUX"/>
        </register>
        <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x26" size="1" ocd-rw="R">
          <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
          <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
          <bitfield caption="ADC  Free Running Select" mask="0x20" name="ADFR"/>
          <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
          <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
          <bitfield caption="ADC  Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x24" size="2" mask="0xFFFF"/>
      </register-group>
      <value-group name="ANALOG_ADC_V_REF2">
        <value caption="AREF, Internal Vref turned off" name="AREF_INTERNAL_VREF_TURNED_OFF" value="0x00"/>
        <value caption="AVCC with external capacitor at AREF pin" name="AVCC_WITH_EXTERNAL_CAPACITOR_AT_AREF_PIN" value="0x01"/>
        <value caption="Reserved" name="RESERVED" value="0x02"/>
        <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="INTERNAL_2_56V_VOLTAGE_REFERENCE_WITH_EXTERNAL_CAPACITOR_AT_AREF_PIN" value="0x03"/>
      </value-group>
      <value-group name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="2" value="0x00"/>
        <value caption="2" name="2" value="0x01"/>
        <value caption="4" name="4" value="0x02"/>
        <value caption="8" name="8" value="0x03"/>
        <value caption="16" name="16" value="0x04"/>
        <value caption="32" name="32" value="0x05"/>
        <value caption="64" name="64" value="0x06"/>
        <value caption="128" name="128" value="0x07"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="CQFP64" caption="64">
      <pin position="1" pad="PEN"/>
      <pin position="2" pad="PE0"/>
      <pin position="3" pad="PE1"/>
      <pin position="4" pad="PE2"/>
      <pin position="5" pad="PE3"/>
      <pin position="6" pad="PE4"/>
      <pin position="7" pad="PE5"/>
      <pin position="8" pad="PE6"/>
      <pin position="9" pad="PE7"/>
      <pin position="10" pad="PB0"/>
      <pin position="11" pad="PB1"/>
      <pin position="12" pad="PB2"/>
      <pin position="13" pad="PB3"/>
      <pin position="14" pad="PB4"/>
      <pin position="15" pad="PB5"/>
      <pin position="16" pad="PB6"/>
      <pin position="17" pad="PB7"/>
      <pin position="18" pad="PG3"/>
      <pin position="19" pad="PG4"/>
      <pin position="20" pad="RESET"/>
      <pin position="21" pad="VCC"/>
      <pin position="22" pad="GND"/>
      <pin position="23" pad="XTAL2"/>
      <pin position="24" pad="XTAL1"/>
      <pin position="25" pad="PD0"/>
      <pin position="26" pad="PD1"/>
      <pin position="27" pad="PD2"/>
      <pin position="28" pad="PD3"/>
      <pin position="29" pad="PD4"/>
      <pin position="30" pad="PD5"/>
      <pin position="31" pad="PD6"/>
      <pin position="32" pad="PD7"/>
      <pin position="33" pad="PG0"/>
      <pin position="34" pad="PG1"/>
      <pin position="35" pad="PC0"/>
      <pin position="36" pad="PC1"/>
      <pin position="37" pad="PC2"/>
      <pin position="38" pad="PC3"/>
      <pin position="39" pad="PC4"/>
      <pin position="40" pad="PC5"/>
      <pin position="41" pad="PC6"/>
      <pin position="42" pad="PC7"/>
      <pin position="43" pad="PG2"/>
      <pin position="44" pad="PA7"/>
      <pin position="45" pad="PA6"/>
      <pin position="46" pad="PA5"/>
      <pin position="47" pad="PA4"/>
      <pin position="48" pad="PA3"/>
      <pin position="49" pad="PA2"/>
      <pin position="50" pad="PA1"/>
      <pin position="51" pad="PA0"/>
      <pin position="52" pad="VCC"/>
      <pin position="53" pad="GND"/>
      <pin position="54" pad="PF7"/>
      <pin position="55" pad="PF6"/>
      <pin position="56" pad="PF5"/>
      <pin position="57" pad="PF4"/>
      <pin position="58" pad="PF3"/>
      <pin position="59" pad="PF2"/>
      <pin position="60" pad="PF1"/>
      <pin position="61" pad="PF0"/>
      <pin position="62" pad="AREF"/>
      <pin position="63" pad="GND"/>
      <pin position="64" pad="AVCC"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
